# =============================================================================
#  Brewfile — All your tools in one place
#  Install: brew bundle --file=Brewfile
#  Export your current setup: brew bundle dump --force --file=Brewfile
# =============================================================================

# ─── Core CLI Tools ──────────────────────────────────────────────────────────
brew "git"
brew "gh"                    # GitHub CLI
brew "jq"                    # JSON processor
brew "fzf"                   # Fuzzy finder
brew "ripgrep"               # Fast grep (rg)
brew "fd"                    # Fast find
brew "bat"                   # Better cat
brew "eza"                   # Better ls
brew "delta"                 # Better git diff
brew "lazygit"               # TUI git client
brew "tree"
brew "wget"
brew "htop"

# ─── Node.js ─────────────────────────────────────────────────────────────────
brew "fnm"

# ─── Python ──────────────────────────────────────────────────────────────────
brew "python@3"
brew "pipx"
# brew "pyenv"               # Uncomment if you need multiple Python versions

# ─── Go ──────────────────────────────────────────────────────────────────────
brew "go"

# ─── Ruby (for CocoaPods) ────────────────────────────────────────────────────
brew "ruby"

# ─── Mobile Dev ──────────────────────────────────────────────────────────────
brew "cocoapods"
brew "fastlane"
brew "watchman"              # Required by React Native
# brew "flipper"             # React Native debugger (optional)

# ─── Java (for Android) ─────────────────────────────────────────────────────
cask "zulu@17"               # Azul Zulu JDK 17 (recommended for RN/Android)

# ─── Zsh Plugins ─────────────────────────────────────────────────────────────
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ─── Apps (uncomment what you use) ───────────────────────────────────────────
cask "visual-studio-code"
# cask "cursor"
# cask "iterm2"
cask "warp"
cask "android-studio"
# cask "orbstack"            # Lightweight Docker alternative
# cask "docker"
# cask "figma"
# cask "postman"
# cask "slack"
# cask "arc"                 # Arc browser
# cask "raycast"             # Spotlight replacement
